daydien12/fwup_delta_stm32/1.fwup_delta_stm32/USER/handle_msg/handle_msg.h
#ifndef _HANDLE_MSG_H_
#define _HANDLE_MSG_H_

#ifdef __cplusplus
extern "C"{
#endif

#include <stdint.h>
#include "stm32f10x.h" 
#include "bts_frame_message.h"

/*
 * OTA process state
 */
typedef enum
{
  OTA_STATE_START   = 1,
  OTA_STATE_DATA    = 2,
  OTA_STATE_END     = 3,
	OTA_STATE_DELETE  = 4,
}OtaState_e;

typedef struct
{
	uint8_t  cmd;
	uint32_t package_size;
  uint32_t package_crc;
	char name[50];
}__attribute__((packed)) uploadMetaData_t;

typedef struct
{
	uint8_t  cmd;
	uint8_t  length;
	uint32_t offset;
	uint8_t  data[128];
}__attribute__((packed)) uploadData_t;

typedef struct
{
	uint8_t cmd;
	char name[50];
}__attribute__((packed)) uploadDeleteFIle_t;

typedef struct
{
	uint32_t size_file_bin;
	uint32_t count_size_file;
	uint32_t check_sum;
	char Name[50];
}uploadValueAll_t;

typedef struct
{
	uint8_t flag;
	uint8_t arr_msg_response[10];
	uint16_t count_time_send;
}responseValueAll_t;

void Handle_GetMsg(const messageFrameMsg_t datain);
void Handle_ResponseMsg(void);
void Handle_InitValueAll(void);

#ifdef __cplusplus
}
#endif

#endif
